#------------------------------------------------ Defaults
vim
git
curl
wget
rsync
man-pages
sed
awk
#------------------------------------------------ Dependencies
pacman-contrib
hyprland
hyprpaper
hyprlock
hypridle
hyprpicker
noto-fonts
otf-font-awesome
ttf-fira-sans
ttf-fira-code
ttf-firacode-nerd
xdg-desktop-portal-hyprland
xdg-desktop-portal-gtk
xdg-user-dirs
libnotify
dunst
udiskie
kitty
qt5-wayland
qt6-wayland
networkmanager
network-manager-applet
bluez
bluez-utils
blueman
brightnessctl
rofi-wayland
waybar
sddm
qt5-graphicaleffects
qt5-quickcontrols
qt5-quickcontrols2
qt5-svg
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
gst-plugin-pipewire
wireplumber
pavucontrol
pamixer
jq
polkit-gnome
python-pyamdgpuinfo
dolphin
ffmpegthumbs
kde-cli-tools
imagemagick
qt5-imageformats
parallel
#------------------------------------------------ User Prefferences
#tmux
#fzf
#zsh
#tldr
#python-pipx
#cava
#spotify
#spicetify-cli
#discord
#telegram
#------------------------------------------------ Networking
#nmap
#tcpdump
#bind-utils
#screen
#------------------------------------------------ Pentesting
#metasploit
#exploitdb
#aircrack-ng
